const airportCoords: { [key: string]: [number, number] } = {
    "ICN": [37.469075, 126.450517],  // 인천국제공항 (출발지)
    "SFO": [37.774929, -122.419418],  // 샌프란시스코 국제공항 (도착지)
    "LAX": [33.941589, -118.40853],  // 로스앤젤레스 국제공항
    "JFK": [40.641311, -73.778139],  // 존 F. 케네디 국제공항 (뉴욕)
    "CDG": [49.0096906, 2.5479245],  // 샤를 드 골 국제공항 (파리)
    "HND": [35.5493932, 139.7798386],  // 도쿄 하네다 국제공항
    "NRT": [35.765981, 140.385422],  // 도쿄 나리타 국제공항
    "LHR": [51.4700223, -0.4542955],  // 런던 히드로 공항
    "SIN": [1.3644208, 103.9915302],  // 싱가포르 창이 공항
    "SYD": [-33.9399228, 151.1752764],  // 시드니 킹스포드 스미스 공항
    "DXB": [25.2531745, 55.3656728],  // 두바이 국제공항
    "HKG": [22.308046, 113.918480],  // 홍콩 국제공항
    "BKK": [13.6899991, 100.7501124],  // 방콕 수완나품 공항
    "FCO": [41.8002778, 12.2388889],  // 로마 피우미치노 공항
    "AMS": [52.3105386, 4.7682744],  // 암스테르담 스히폴 공항
    "FRA": [50.0379335, 8.5621518],  // 프랑크푸르트 국제공항
    "MUC": [48.353802, 11.786024],  // 뮌헨 국제공항
    "BCN": [41.297445, 2.083294],  // 바르셀로나 엘프라트 공항
    "GRU": [-23.435556, -46.473056],  // 상파울루 과룰류스 국제공항
    "EZE": [-34.822222, -58.535833],  // 부에노스아이레스 에세이사 국제공항
    "MAD": [40.4893538, -3.5679514],  // 마드리드 바라하스 공항
    "ORD": [41.9741625, -87.9073214],  // 시카고 오헤어 국제공항
    "ATL": [33.640411, -84.419853],  // 애틀랜타 하츠필드 잭슨 국제공항
    "DFW": [32.8998091, -97.0403352],  // 댈러스 포트워스 국제공항
    "IAH": [29.990219, -95.336783],  // 조지 부시 인터컨티넨털 공항 (휴스턴)
    "LAS": [36.084, -115.1537],  // 라스베이거스 맥캐런 국제공항
    "SEA": [47.4502, -122.3088],  // 시애틀 터코마 국제공항
    "MIA": [25.7959, -80.2870],  // 마이애미 국제공항
    "YVR": [49.1947, -123.1792],  // 밴쿠버 국제공항
    "YYZ": [43.6777, -79.6248],  // 토론토 피어슨 국제공항
    "CPT": [-33.9694, 18.5975],  // 케이프타운 국제공항
    "JNB": [-26.1336, 28.2313],  // 요하네스버그 OR 탐보 국제공항
    "MEL": [-37.673333, 144.843333],  // 멜버른 툴라마린 공항
    "AKL": [-37.0081, 174.7917],  // 오클랜드 국제공항
    "KIX": [34.4342, 135.2441],  // 오사카 간사이 국제공항
    "CTS": [42.7752, 141.6923],  // 삿포로 신치토세 공항
    "FUK": [33.5859, 130.4507],  // 후쿠오카 공항
    "KUL": [2.7456, 101.7099],  // 쿠알라룸푸르 국제공항
    "CGK": [-6.1256, 106.6558],  // 자카르타 수카르노 하타 국제공항
    "MNL": [14.5086, 121.0198],  // 마닐라 니노이 아키노 국제공항
    "SGN": [10.8188, 106.6517],  // 호치민시 탄손누트 국제공항
    "HAN": [21.2141, 105.8046],  // 하노이 노이바이 국제공항
    "DPS": [-8.7481, 115.1666],  // 발리 응우라라이 국제공항
};

export default airportCoords;